"""
                           _
                           \"-._ _.--"~~"--._
                            \   "            ^.    ___
                            /                  \.-~_.-~
                     .-----'     /\/"\ /~-._      /
                    /  __      _/\-.__\L_.-/\     "-.
                   /.-"  \    ( ` \_o>"<o_/  \  .--._\
                  /'      \    \:     "     :/_/     "`
                          /  /\ "\    ~    /~"
                          \ I  \/]"-._ _.-"[
                       ___ \|___/ ./    l   \___   ___
                  .--v~   "v` ( `-.__   __.-' ) ~v"   ~v--.
               .-{   |     :   \_    "~"    _/   :     |   }-.
              /   \  |           ~-.,___,.-~           |  /   \
             ]     \ |                                 | /     [
             /\     \|     :                     :     |/     /\
            /  ^._  _K.___,^                     ^.___,K_  _.^  \
           /   /  "~/  "\                           /"  \~"  \   \
          /   /    /     \ _          :          _ /     \    \   \
        .^--./    /       Y___________l___________Y       \    \.--^.
        [    \   /        |        [/    ]        |        \   /    ]
        |     "v"         l________[____/]________j  -melon }r"     /
        }------t          /                       \       /`-.     /
        |      |         Y                         Y     /    "-._/
        }-----v'         |         :               |     7-.     /
        |   |_|          |         l               |    / . "-._/
        l  .[_]          :          \              :  r[]/_.  /
         \_____]                     "--.             "-.____/
                                            "Bug! No way!"
                                                      ---Melon
         
"""
from collections import OrderedDict

# def haha():
#     """
#     这是个注释
#     :return:
#     """
#     print("haha")
#
# # 打印haha()的注释
# help(haha)

# # 有序字典，按添加时间先后顺序排列
# dict = OrderedDict()
#
# dict[3] = 'c'
# dict[1] = 'a'
# dict[2] = 'b'
#
# print(dict)

if __name__ == '__main__':
    # from redis import *
    #
    # sr = StrictRedis(15)
    dict = {'code': 1, 'errmsg': '添加购物车成功'}
    b = dict.items()
    print(b)
    for i in dict.items():
        print(i)
